Revit 2027 API
ExternalFileReference.IsValidPathTypeForExternalFileReference Method
 Checks whether a PathType enum value will be valid to use with this ExternalFileReference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidPathTypeForExternalFileReference(
	PathType pathType
)
Public Function IsValidPathTypeForExternalFileReference (
	pathType As PathType
) As Boolean
public:
bool IsValidPathTypeForExternalFileReference(
	PathType pathType
)
member IsValidPathTypeForExternalFileReference :
        pathType : PathType -> bool
Parameters
pathType PathType
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink
 PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace